Revit 2026 API

# ExternalServiceOptions Class

---

Various options affecting the behavior of an External Service

SystemObject Autodesk.Revit.DB.ExternalServiceExternalServiceOptions

**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExternalServiceOptions : IDisposable
```
```vb
Public Class ExternalServiceOptions
	Implements IDisposable
```
```cpp
public ref class ExternalServiceOptions : IDisposable
```
```fsharp
type ExternalServiceOptions =
    class
        interface IDisposable
    end
```

The ExternalServiceOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExternalServiceOptions | Constructs a new ExternalServiceOptions with default settings. |

|  | Name | Description |
| --- | --- | --- |
|  | IsPublic | This property denotes a service as either public or private. |
|  | IsRecordable | Indicates whether executions of the service is recorded in documents or not. |
|  | IsSelfsynchronizing | Indicates whether the service's record of used services (in a particular document) can independently wary between local clients and the corresponding central model. It is then up to the service's owner to assure proper local-central synchronization. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SupportActivation | Indicates if the service supports activation/deactivation of the servers. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ExternalServiceOptions |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

Options are provided at the time of registering a service. After a service is registered, the options cannot be changed.

#### Reference

Autodesk.Revit.DB.ExternalService Namespace